//=============================================================================
//
// プレイヤー処理 [gun.h]
// Author : AKIRA TANAKA
//
//=============================================================================
#ifndef _GUN_H_
#define _GUN_H_


#include "main.h"
#include "project3D.h"


#define GUN_MAX					(1)

//*****************************************************************************
// 構造体定義
//*****************************************************************************

typedef struct
{
	PROJECT3D						base;						// 3D基本構造体
	int								bulletNow;							
	int								bulletMax;
	PART							fire;

} GUN;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGun(void);
void UninitGun(void);
void UpdateGun(void);
void DrawGun(void);
GUN *GetGun(int pno);

#endif
